### TODO: realizar generalização na copia do dataset e nao na referencia

In [1]:
import random as rdm
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("salario.csv")
df.head()

   id           pais       estado     cidade  genero        data   salario
0   1  United States      Alabama     Mobile    Male  10/01/1987  $5407.86
1   2       Portugal        Porto       Rego    Male  29/11/2007  $7833.82
2   3         Sweden       Kalmar   Emmaboda    Male  23/06/1984  $5530.85
3   4         Sweden  Västmanland       Sala  Female  04/11/1983  $2803.76
4   5         France     Bretagne  Quimperlé  Female  18/11/1990  $2201.87

In [78]:
df.describe()

                id
count  1000.000000
mean    500.500000
std     288.819436
min       1.000000
25%     250.750000
50%     500.500000
75%     750.250000
max    1000.000000

## Unindo os atributos de localidade

In [3]:
ids = df.id
cities = df.cidade
states = df.estado
countries = df.pais

In [4]:
locality = []
for i in range(len(cities)):
    locality.append([ids[i], str('{}, {}, {}'.format(cities[i], states[i], countries[i]))])

In [5]:
df_locality = pd.DataFrame(locality, columns=['id', 'localidade'])
df_locality.head()

   id                      localidade
0   1  Mobile, Alabama, United States
1   2           Rego, Porto, Portugal
2   3        Emmaboda, Kalmar, Sweden
3   4       Sala, Västmanland, Sweden
4   5     Quimperlé, Bretagne, France

## Unindo os dataframes

In [6]:
join_dataset = pd.concat([df, df_locality], axis=1, join='inner')
join_dataset.head()

,id,pais,estado,cidade,genero,data,salario,id,localidade
0,1,United States,Alabama,Mobile,Male,10/01/1987,$5407.86,1,"Mobile, Alabama, United States"
1,2,Portugal,Porto,Rego,Male,29/11/2007,$7833.82,2,"Rego, Porto, Portugal"
2,3,Sweden,Kalmar,Emmaboda,Male,23/06/1984,$5530.85,3,"Emmaboda, Kalmar, Sweden"
3,4,Sweden,Västmanland,Sala,Female,04/11/1983,$2803.76,4,"Sala, Västmanland, Sweden"
4,5,France,Bretagne,Quimperlé,Female,18/11/1990,$2201.87,5,"Quimperlé, Bretagne, France"

## Removendo atributos

In [67]:
dataset = join_dataset.drop(columns = ['id', 'pais', 'estado', 'cidade', 'salario'])
dataset.head()

   genero        data                      localidade
0    Male  10/01/1987  Mobile, Alabama, United States
1    Male  29/11/2007           Rego, Porto, Portugal
2    Male  23/06/1984        Emmaboda, Kalmar, Sweden
3  Female  04/11/1983       Sala, Västmanland, Sweden
4  Female  18/11/1990     Quimperlé, Bretagne, France

## Função de generalização da data

In [34]:
def date_generalization(dataset, level):
    if level == 1:
        # date '**/MM/YYYY'
        for data in range(len(dataset)):
            dataset.iloc[data]['data'] = str('**' + dataset.iloc[data]['data'][2:10])
    elif level == 2:
        # date '**/**/YYYY'
        for data in range(len(dataset)):
            dataset.iloc[data]['data'] = str('**/**' + dataset.iloc[data]['data'][5:10])
    elif level == 3:
        # date'**/**/****'
        for data in range(len(dataset)):
            dataset.iloc[data]['data'] = str('**/**/****')
        
    return dataset

In [51]:
def locality_generalization(dataset, level):
    if level == 0:
        # locality 'city'
        for data in range(len(dataset)):
            dataset.iloc[data]['localidade'] = dataset.iloc[data]['localidade'].split(',')[0]
    elif level == 1:
        # locality 'state,'
        for data in range(len(dataset)):
            dataset.iloc[data]['localidade'] = dataset.iloc[data]['localidade'].split(',')[1]
    elif level == 2:
        # locality 'country'
        for data in range(len(dataset)):
            dataset.iloc[data]['localidade'] = dataset.iloc[data]['localidade'].split(',')[2]
    elif level == 3:
        # locality '*'
        for data in range(len(dataset)):
            dataset.iloc[data]['localidade'] = '*'
        
    return dataset

In [52]:
def gender_generalization(dataset, level):
    if level == 1:
        # gender '*'
        for data in range(len(dataset)):
            dataset.iloc[data]['genero'] = '*'
            
    return dataset

## Gerando as Classes de Equivalência

In [79]:
dataset_test = dataset.head(500)
dataset_test.head()

date_generalization(dataset_test, 2)

     genero        data                             localidade
0      Male  **/**/1987                          United States
1      Male  **/**/2007                               Portugal
2      Male  **/**/1984                                 Sweden
3    Female  **/**/1983                                 Sweden
4    Female  **/**/1990                                 France
..      ...         ...                                    ...
495  Female  **/**/2008          Pemex, Veracruz Llave, Mexico
496    Male  **/**/1987           Paradela, Bragança, Portugal
497  Female  **/**/2000             Sarzedo, Coimbra, Portugal
498  Female  **/**/1994  Newport News, Virginia, United States
499  Female  **/**/1990             Constance, Porto, Portugal

[500 rows x 3 columns]

In [72]:
dataset_test.groupby('data').count()

            genero  localidade
data
**/01/1987       1           1
**/01/2007       1           1
**/03/1989       1           1
**/05/1990       1           1
**/06/1984       1           1
**/07/1981       1           1
**/11/1983       1           1
**/11/1990       1           1
**/11/1992       1           1
**/11/2007       1           1

In [80]:
dataset_test.groupby('data').count()

            genero  localidade
data
**/**/1980       6           6
**/**/1981      26          26
**/**/1982      11          11
**/**/1983      13          13
**/**/1984      22          22
**/**/1985      18          18
**/**/1986      16          16
**/**/1987      13          13
**/**/1988      19          19
**/**/1989      14          14
**/**/1990      20          20
**/**/1991      10          10
**/**/1992      10          10
**/**/1993      17          17
**/**/1994      25          25
**/**/1995      23          23
**/**/1996      19          19
**/**/1997      14          14
**/**/1998      14          14
**/**/1999      22          22
**/**/2000      24          24
**/**/2001      15          15
**/**/2002      13          13
**/**/2003      16          16
**/**/2004      21          21
**/**/2005      19          19
**/**/2006       9           9
**/**/2007      15          15
**/**/2008      17          17
**/**/2009      11          11
**/**/2010       8           8

## Função de Precisão

(sum i -> Na (sum j -> |D|(h/(HGV Ai))))/ (|D| * Na)

- D: conjunto de dados
- Na: número de atributos semi-identificadores
- h: altura da hierarquia de generalização de valor do atributo Ai após anonimização
- |HGVAi|: altura máxima da hierarquia

In [57]:
def precision(D, Na, h, HGVA):
    summation = 0
    for i in range(Na):
        for j in range (D):
            summation += (h[j] / (HGVA[i]))
    
    return 1 - (summation / (D * Na))